depletionmode/cupc8/fw/wifi/port/esp32c3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_FREERTOS_HZ=1000
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y
# SOCK_STATUS and RXREADY count waiting bytes with FIONREAD, which lwIP only
# implements for TCP with SO_RCVBUF (WIFI-003 found it always 0 without)
CONFIG_LWIP_SO_RCVBUF=y
